*******************************************************************************
IDENTIFICATION DIVISION.
*******************************************************************************
PROGRAM-ID.    HELLO_WORLD.
AUTHOR.        Oren Nissan.
DATE-WRITTEN.  13-May-2026.

*******************************************************************************
PROCEDURE DIVISION.
*******************************************************************************
*----------------------------------------------------------------------
A-MAIN         SECTION.
*----------------------------------------------------------------------
A-00.

    PERFORM B-INIT

    PERFORM C-PROCESS

    PERFORM Z-FINISH
    .
A-EXIT.     EXIT.
*----------------------------------------------------------------------
B-INIT         SECTION.
*----------------------------------------------------------------------
B-00.

    CONTINUE
    .
B-EXIT.     EXIT.
*----------------------------------------------------------------------
C-PROCESS      SECTION.
*----------------------------------------------------------------------
C-00.

    DISPLAY "Hello from COBOL-IT on Linux"
    .
C-EXIT.     EXIT.
*----------------------------------------------------------------------
Z-FINISH       SECTION.
*----------------------------------------------------------------------
Z-00.

    STOP RUN
    .
Z-EXIT.     EXIT.
